Revit 2026 API

# FilteredWorksetCollectorToWorksetIds Method

---

Returns the complete set of workset ids that pass the filter(s).

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ICollection<WorksetId> ToWorksetIds()
```
```vb
Public Function ToWorksetIds As ICollection(Of WorksetId)
```
```cpp
public:
ICollection<WorksetId^>^ ToWorksetIds()
```
```fsharp
member ToWorksetIds : unit -> ICollection<WorksetId>
```

#### Return Value

ICollectionWorksetId The complete set of workset ids.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The collector does not have a filter applied. Extraction or iteration of worksets is not permitted without a filter. |

This will reset the collector to the beginning and extract all worksets that pass the applied filter(s). If you have an active iterator to this same collector it will be stopped by this call.

#### Reference

FilteredWorksetCollector Class

Autodesk.Revit.DB Namespace